<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>GPL - Fran&ccedil;ais</title>
</head>
<body>
<h2>GNU General Public License</h2>
<h3>Introduction</h3>
<p>Voici une adaptation non officielle de la Licence Publique G&eacute;n&eacute;rale du projet
GNU. Elle n'a pas &eacute;t&eacute; publi&eacute;e par la Free Software Foundation et son contenu
n'a aucune port&eacute;e l&eacute;gale car seule la version anglaise de ce document d&eacute;taille
le mode de distribution des logiciels sous GNU GPL. Nous esp&eacute;rons cependant qu'elle permettra
aux francophones de mieux comprendre la GPL.</p>
<h2>Licence Publique G&eacute;n&eacute;rale GNU</h2>
<h3>Version 2, Juin 1991</h3>
<p>Copyright &copy; 1989, 1991 Free Software Foundation, Inc.<br>
59 Temple Place, Suite 330, Boston, MA 02111-1307<br>
Etats-Unis, 1989, 1991.</p>
<p>La copie et la distribution de copies exactes de ce document sont autoris&eacute;es, mais
aucune modification n'est permise.</p>
<h3>Pr&eacute;ambule</h3>
<p>Les licences d'utilisation de la plupart des programmes sont d&eacute;finies pour limiter ou
supprimer toute libert&eacute; &agrave; l'utilisateur. A l'inverse, la Licence Publique
G&eacute;n&eacute;rale <i>(General Public License)</i> est destin&eacute;e &agrave; vous garantir la
libert&eacute; de partager et de modifier les logiciels libres, et de s'assurer que ces logiciels
sont effectivement accessibles &agrave; tout utilisateur.</p>
<p>Cette Licence Publique G&eacute;n&eacute;rale s'applique &agrave; la plupart des programmes
de la Free Software Foundation, comme &agrave; tout autre programme dont l'auteur l'aura
d&eacute;cid&eacute; <i>(d'autres logiciels de la FSF sont couverts pour leur part par la
Licence Publique G&eacute;n&eacute;rale pour Biblioth&egrave;ques GNU (LGPL))</i>. Vous pouvez aussi
appliquer les termes de cette Licence &agrave; vos propres programmes, si vous le d&eacute;sirez.</p>
<p>Libert&eacute; des logiciels ne signifie pas n&eacute;cessairement gratuit&eacute;. Notre
Licence est con&ccedil;ue pour vous assurer la libert&eacute; de distribuer des copies des
programmes, gratuitement ou non, de recevoir le code source ou de pouvoir l'obtenir, de modifier les
programmes ou d'en utiliser des &eacute;l&eacute;ments dans de nouveaux programmes libres, en
sachant que vous y &ecirc;tes autoris&eacute;.</p>
<p>Afin de garantir ces droits, nous avons d&ucirc; introduire des restrictions interdisant
&agrave; quiconque de vous les refuser ou de vous demander d'y renoncer. Ces restrictions vous
imposent en retour certaines obligations si vous distribuez ou modifiez des copies de programmes
prot&eacute;g&eacute;s par la Licence. En d'autre termes, il vous incombera en ce cas de :</p>
<ol>
 <li>transmettre aux destinataires tous les droits que vous poss&eacute;dez,</li>
 <li>exp&eacute;dier aux destinataires le code source ou bien tenir celui-ci &agrave; leur
 disposition,</li>
 <li>leur remettre cette Licence afin qu'ils prennent connaissance de leurs droits.</li>
</ol>
<p>Nous prot&eacute;geons vos droits de deux fa&ccedil;ons : d'abord par le copyright du
logiciel, ensuite par la remise de cette Licence qui vous autorise l&eacute;galement &agrave;
copier, distribuer et/ou modifier le logiciel.</p>
<p>En outre, pour prot&eacute;ger chaque auteur ainsi que la FSF, nous affirmons solennellement
que le programme concern&eacute; ne fait l'objet d'aucune garantie. Si un tiers le modifie puis le
redistribue, tous ceux qui en recevront une copie doivent savoir qu'il ne s'agit pas de l'original
afin qu'une copie d&eacute;fectueuse n'entache pas la r&eacute;putation de l'auteur du logiciel.</p>
<p>Enfin, tout programme libre est sans cesse menac&eacute; par des d&eacute;p&ocirc;ts de
brevets. Nous souhaitons &agrave; tout prix &eacute;viter que des distributeurs puissent
d&eacute;poser des brevets sur les Logiciels Libres pour leur propre compte. Pour &eacute;viter
cela, nous stipulons bien que tout d&eacute;p&ocirc;t &eacute;ventuel de brevet doit accorder
express&eacute;ment &agrave; tout un chacun le libre usage du produit.</p>
<p>Les dispositions pr&eacute;cises et les conditions de copie, de distribution et de
modification de nos logiciels sont les suivantes :</p>
<h2>Stipulations et conditions de la Licence Publique G&eacute;n&eacute;rale GNU relatives
&agrave; la copie, la distribution et la modification</h2>
<h3>Article 0</h3>
<p>La pr&eacute;sente Licence s'applique &agrave; tout Programme <i>(ou autre travail)</i>
o&ugrave; figure une note, plac&eacute;e par le d&eacute;tenteur des droits, stipulant que ledit
Programme ou travail peut &ecirc;tre distribu&eacute; selon les termes de la pr&eacute;sente
Licence. Le terme Programme d&eacute;signe aussi bien le Programme lui-m&ecirc;me que tout travail
qui en est d&eacute;riv&eacute; selon la loi, c'est-&agrave;-dire tout ouvrage reproduisant le
Programme ou une partie de celui-ci, &agrave; l'identique ou bien modifi&eacute;, et/ou traduit dans
une autre langue <i>(la traduction est consid&eacute;r&eacute;e comme une modification)</i>. Chaque
personne concern&eacute;e par la Licence Publique G&eacute;n&eacute;rale sera d&eacute;sign&eacute;e
par le terme Vous.</p>
<p>Les activit&eacute;s autres que copie, distribution et modification ne sont pas couvertes par
la pr&eacute;sente Licence et sortent de son cadre. Rien ne restreint l'utilisation du Programme et
les donn&eacute;es issues de celui-ci ne sont couvertes que si leur contenu constitue un travail
bas&eacute; sur le logiciel <i>(ind&eacute;pendemment du fait d'avoir &eacute;t&eacute;
r&eacute;alis&eacute; en lan&ccedil;ant le Programme)</i>. Tout d&eacute;pend de ce que le Programme est
cens&eacute; produire.</p>
<h3>Article 1</h3>
<p>Vous pouvez copier et distribuer des copies conformes du code source du Programme, tel que
Vous l'avez re&ccedil;u, sur n'importe quel support, &agrave; condition de placer sur chaque copie
un copyright appropri&eacute; et une restriction de garantie, de ne pas modifier ou omettre toutes
les stipulations se r&eacute;f&eacute;rant &agrave; la pr&eacute;sente Licence et &agrave; la
limitation de garantie, et de fournir avec toute copie du Programme un exemplaire de la Licence.</p>
<p>Vous pouvez demander une r&eacute;tribution financi&egrave;re pour la r&eacute;alisation de
la copie et demeurez libre de proposer une garantie assur&eacute;e par vos soins, moyennant
finances.</p>
<h3>Article 2</h3>
<p>Vous pouvez modifier votre copie ou vos copies du Programme ou partie de celui-ci, ou d'un
travail bas&eacute; sur ce Programme, et copier et distribuer ces modifications selon les termes de
l'article 1, &agrave; condition de Vous conformer &eacute;galement aux conditions suivantes :</p>
<ol type="a">
 <li>Ajouter aux fichiers modifi&eacute;s l'indication tr&egrave;s claire des modifications
 effectu&eacute;es, ainsi que la date de chaque changement.</li>
 <li>Distribuer sous les termes de la Licence Publique G&eacute;n&eacute;rale l'ensemble de
 toute r&eacute;alisation contenant tout ou partie du Programme, avec ou sans modifications.</li>
 <li>Si le Programme modifi&eacute; lit des commandes de mani&egrave;re interactive lors de son
 ex&eacute;cution, faire en sorte qu'il affiche, lors d'une invocation ordinaire, le copyright
 appropri&eacute; en indiquant clairement la limitation de garantie <i>(ou la garantie que Vous
 Vous engagez &agrave; fournir Vous-m&ecirc;me)</i>, qu'il stipule que tout utilisateur peut librement
 redistribuer le Programme selon les conditions de la Licence Publique G&eacute;n&eacute;rale GNU,
 et qu'il montre &agrave; tout utilisateur comment lire une copie de celle-ci <i>(exception : si
 le Programme original est interactif mais n'affiche pas un tel message en temps normal, tout
 travail d&eacute;riv&eacute; de ce Programme ne sera pas non plus contraint de l'afficher)</i>.</li>
</ol>
<p>Toutes ces conditions s'appliquent &agrave; l'ensemble des modifications. Si des
&eacute;l&eacute;ments identifiables de ce travail ne sont pas d&eacute;riv&eacute;s du Programme et
peuvent &ecirc;tre raisonnablement consid&eacute;r&eacute;s comme ind&eacute;pendants, la
pr&eacute;sente Licence ne s'applique pas &agrave; ces &eacute;l&eacute;ments lorsque Vous les
distribuez seuls. Mais, si Vous distribuez ces m&ecirc;mes &eacute;l&eacute;ments comme partie d'un
ensemble coh&eacute;rent dont le reste est bas&eacute; sur un Programme soumis &agrave; la Licence,
ils lui sont &eacute;galement soumis, et la Licence s'&eacute;tend ainsi &agrave; l'ensemble du
produit, quel qu'en soit l'auteur.</p>
<p>Cet article n'a pas pour but de s'approprier ou de contester vos droits sur un travail
enti&egrave;rement r&eacute;alis&eacute; par Vous, mais plut&ocirc;t d'ouvrir droit &agrave; un
contr&ocirc;le de la libre distribution de tout travail d&eacute;riv&eacute; ou collectif
bas&eacute; sur le Programme.</p>
<p>En outre, toute fusion d'un autre travail, non bas&eacute; sur le Programme, avec le
Programme <i>(ou avec un travail d&eacute;riv&eacute; de ce dernier)</i>, effectu&eacute;e sur un
support de stockage ou de distribution, ne fait pas tomber cet autre travail sous le contr&ocirc;le
de la Licence.</p>
<h3>Article 3</h3>
<p>Vous pouvez copier et distribuer le Programme <i>(ou tout travail d&eacute;riv&eacute;
selon les conditions &eacute;nonc&eacute;es dans l'article 2)</i> sous forme de code objet ou
ex&eacute;cutable, selon les termes des articles 1 et 2, &agrave; condition de respecter les clauses
suivantes :</p>
<ol type="a">
 <li>Fournir le code source complet du Programme, sous une forme lisible par un ordinateur et
 selon les termes des articles 1 et 2, sur un support habituellement utilis&eacute; pour
 l'&eacute;change de donn&eacute;es ; ou,</li>
 <li>Faire une offre &eacute;crite, valable pendant au moins trois ans, pr&eacute;voyant de
 donner &agrave; tout tiers qui en fera la demande une copie, sous forme lisible par un ordinateur,
 du code source correspondant, pour un tarif n'exc&eacute;dant pas le co&ucirc;t de la copie, selon
 les termes des articles 1 et 2, sur un support couramment utilis&eacute; pour l'&eacute;change de
 donn&eacute;es informatiques ; ou,</li>
 <li>Informer le destinataire de l'endroit o&ugrave; le code source peut &ecirc;tre obtenu <i>(cette
 solution n'est recevable que dans le cas d'une distribution non commerciale, et uniquement si Vous
 avez re&ccedil;u le Programme sous forme de code objet ou ex&eacute;cutable avec l'offre
 pr&eacute;vue &agrave; l'alin&eacute;a b ci-dessus)</i>.</li>
</ol>
<p>Le code source d'un travail d&eacute;signe la forme de cet ouvrage sous laquelle les
modifications sont les plus ais&eacute;es. Sont ainsi d&eacute;sign&eacute;s la totalit&eacute; du
code source de tous les modules composant un Programme ex&eacute;cutable, de m&ecirc;me que tout
fichier de d&eacute;finition associ&eacute;, ainsi que les scripts utilis&eacute;s pour effectuer la
compilation et l'installation du Programme ex&eacute;cutable. Toutefois, l'environnement standard de
d&eacute;veloppement du syst&egrave;me d'exploitation mis en oeuvre <i>(source ou binaire)</i> --
compilateurs, biblioth&egrave;ques, noyau, etc. -- constitue une exception, sauf si ces
&eacute;l&eacute;ments sont diffus&eacute;s en m&ecirc;me temps que le Programme ex&eacute;cutable.</p>
<p>Si la distribution de l'ex&eacute;cutable ou du code objet consiste &agrave; offrir un
acc&egrave;s permettant de copier le Programme depuis un endroit particulier, l'offre d'un
acc&egrave;s &eacute;quivalent pour se procurer le code source au m&ecirc;me endroit est
consid&eacute;r&eacute; comme une distribution de ce code source, m&ecirc;me si l'utilisateur
choisit de ne pas profiter de cette offre.</p>
<h3>Article 4</h3>
<p>Vous ne pouvez pas copier, modifier, c&eacute;der, d&eacute;poser ou distribuer le Programme
d'une autre mani&egrave;re que l'autorise la Licence Publique G&eacute;n&eacute;rale. Toute
tentative de ce type annule imm&eacute;diatement vos droits d'utilisation du Programme sous cette
Licence. Toutefois, les tiers ayant re&ccedil;u de Vous des copies du Programme ou le droit
d'utiliser ces copies continueront &agrave; b&eacute;n&eacute;ficier de leur droit d'utilisation
tant qu'ils respecteront pleinement les conditions de la Licence.</p>
<h3>Article 5</h3>
<p>Ne l'ayant pas sign&eacute;e, Vous n'&ecirc;tes pas oblig&eacute; d'accepter cette Licence.
Cependant, rien d'autre ne Vous autorise &agrave; modifier ou distribuer le Programme ou quelque
travaux d&eacute;riv&eacute;s : la loi l'interdit tant que Vous n'acceptez pas les termes de cette
Licence. En cons&eacute;quence, en modifiant ou en distribuant le Programme <i>(ou tout travail
bas&eacute; sur lui)</i>, Vous acceptez implicitement tous les termes et conditions de cette Licence.</p>
<h3>Article 6</h3>
<p>La diffusion d'un Programme <i>(ou de tout travail d&eacute;riv&eacute;)</i> suppose l'envoi
simultan&eacute; d'une licence autorisant la copie, la distribution ou la modification du Programme,
aux termes et conditions de la Licence. Vous n'avez pas le droit d'imposer de restrictions
suppl&eacute;mentaires aux droits transmis au destinataire. Vous n'&ecirc;tes pas responsable du
respect de la Licence par un tiers.</p>
<h3>Article 7</h3>
<p>Si, &agrave; la suite d'une d&eacute;cision de Justice, d'une plainte en contrefa&ccedil;on
ou pour toute autre raison <i>(li&eacute;e ou non &agrave; la contrefa&ccedil;on)</i>, des
conditions Vous sont impos&eacute;es <i>(que ce soit par ordonnance, accord amiable ou autre)</i>
qui se r&eacute;v&egrave;lent incompatibles avec les termes de la pr&eacute;sente Licence, Vous
n'&ecirc;tes pas pour autant d&eacute;gag&eacute; des obligations li&eacute;es &agrave; celle-ci :
si Vous ne pouvez concilier vos obligations l&eacute;gales ou autres avec les conditions de cette
Licence, Vous ne devez pas distribuer le Programme.</p>
<p>Si une partie quelconque de cet article est invalid&eacute;e ou inapplicable pour quelque
raison que ce soit, le reste de l'article continue de s'appliquer et l'int&eacute;gralit&eacute; de
l'article s'appliquera en toute autre circonstance.</p>
<p>Le pr&eacute;sent article n'a pas pour but de Vous pousser &agrave; enfreindre des droits ou
des dispositions l&eacute;gales ni en contester la validit&eacute; ; son seul objectif est de
prot&eacute;ger l'int&eacute;grit&eacute; du syst&egrave;me de distribution du Logiciel Libre. De
nombreuses personnes ont g&eacute;n&eacute;reusement contribu&eacute; &agrave; la large gamme de
Programmes distribu&eacute;e de cette fa&ccedil;on en toute confiance ; il appartient &agrave;
chaque auteur/donateur de d&eacute;cider de diffuser ses Programmes selon les crit&egrave;res de son
choix.</p>
<h3>Article 8</h3>
<p>Si la distribution et/ou l'utilisation du Programme est limit&eacute;e dans certains pays par
des brevets ou des droits sur des interfaces, le d&eacute;tenteur original des droits qui place le
Programme sous la Licence Publique G&eacute;n&eacute;rale peut ajouter explicitement une clause de
limitation g&eacute;ographique excluant ces pays. Dans ce cas, cette clause devient une partie
int&eacute;grante de la Licence.</p>
<h3>Article 9</h3>
<p>La Free Software Foundation se r&eacute;serve le droit de publier p&eacute;riodiquement des
mises &agrave; jour ou de nouvelles versions de la Licence. R&eacute;dig&eacute;es dans le
m&ecirc;me esprit que la pr&eacute;sente version, elles seront cependant susceptibles d'en modifier
certains d&eacute;tails &agrave; mesure que de nouveaux probl&egrave;mes se font jour.</p>
<p>Chaque version poss&egrave;de un num&eacute;ro distinct. Si le Programme pr&eacute;cise un
num&eacute;ro de version de cette Licence et &agrave; toute version ult&eacute;rieure &agrave;, Vous
avez le choix de suivre les termes et conditions de cette version ou de toute autre version plus
r&eacute;cente publi&eacute;e par la Free Software Foundation. Si le Programme ne sp&eacute;cifie
aucun num&eacute;ro de version, Vous pouvez alors choisir l'une quelconque des versions
publi&eacute;es par la Free Software Foundation.</p>
<h3>Article 10</h3>
<p>Si Vous d&eacute;sirez incorporer des &eacute;l&eacute;ments du Programme dans d'autres
Programmes libres dont les conditions de distribution diff&egrave;rent, Vous devez &eacute;crire
&agrave; l'auteur pour lui en demander la permission. Pour ce qui est des Programmes directement
d&eacute;pos&eacute;s par la Free Software Foundation, &eacute;crivez-nous : une exception est
toujours envisageable. Notre d&eacute;cision sera bas&eacute;e sur notre volont&eacute; de
pr&eacute;server la libert&eacute; de notre Programme ou de ses d&eacute;riv&eacute;s et celle de
promouvoir le partage et la r&eacute;utilisation du logiciel en g&eacute;n&eacute;ral.</p>
<h2>Limitation de garantie</h2>
<h3>Article 11</h3>
<p>Parce que l'utilisation de ce Programme est libre et gratuite, aucune garantie n'est fournie,
comme le permet la loi. Sauf mention &eacute;crite, les d&eacute;tenteurs du copyright et/ou les
tiers fournissent le Programme en l'&eacute;tat, sans aucune sorte de garantie explicite ou
implicite, y compris les garanties de commercialisation ou d'adaptation dans un but particulier.
Vous assumez tous les risques quant &agrave; la qualit&eacute; et aux effets du Programme. Si le
Programme est d&eacute;fectueux, Vous assumez le co&ucirc;t de tous les services, corrections ou
r&eacute;parations n&eacute;cessaires.</p>
<h3>Article 12</h3>
<p>Sauf lorsqu'explicitement pr&eacute;vu par la Loi ou accept&eacute; par &eacute;crit, ni le
d&eacute;tenteur des droits, ni quiconque autoris&eacute; &agrave; modifier et/ou redistribuer le
Programme comme il est permis ci-dessus ne pourra &ecirc;tre tenu pour responsable de tout dommage
direct, indirect, secondaire ou accessoire <i>(pertes financi&egrave;res dues au manque &agrave;
gagner, &agrave; l'interruption d'activit&eacute;s ou &agrave; la perte de donn&eacute;es, etc.,
d&eacute;coulant de l'utilisation du Programme ou de l'impossibilit&eacute; d'utiliser celui-ci)</i>.</p>
<h2>Fin des termes et conditions</h2>
</body>
</html>
